app/graphql/mutations/add_to_cart.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."shopping_cart_id" = $1 AND "cart_items"."product_id" = $2 LIMIT $3  [["shopping_cart_id", 1], ["product_id", 1], ["LIMIT", 1]]
INSERT INTO "cart_items" ("quantity", "created_at", "updated_at", "shopping_cart_id", "product_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 3], ["created_at", "2019-01-16 23:11:19.476608"], ["updated_at", "2019-01-16 23:11:19.476608"], ["shopping_cart_id", 1], ["product_id", 1]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 6], ["updated_at", "2019-01-18 19:48:45.551606"], ["id", 16]]
UPDATE "shopping_carts" SET "total_cost" = $1, "updated_at" = $2 WHERE "shopping_carts"."id" = $3  [["total_cost", "8.49"], ["updated_at", "2019-01-18 19:51:47.433934"], ["id", 1]]
---
  def call(_obj, args, _ctx)
    product = Product.find_by(id: args[:product_id])
    cart = ShoppingCart.find_by(user_id: args[:user_id])
    if product.nil?
      raise GraphQL::ExecutionError, "Product with the product id #{args[:product_id]} does not exist."
    end
    existing = cart.cart_items.find_by(product_id: product.id)


    if existing.nil?
      item = cart.cart_items.create(:product_id => product.id, :quantity => args[:quantity])
      cart.completed = false
      puts cart.cart_items
    else
      existing.quantity += args[:quantity]
      cart.completed = false
      cart.save