app/graphql/mutations/add_to_inventory.rb

  def call(_obj, args, _ctx)
    existing = Product.find_by(title: args[:title])
    if existing.nil?
      product = Product.create(title: args[:title], description: args[:description], price: args[:price], shipping: args[:shipping], inventory_count: args[:quantity])
      product.save
      puts product
      product
    else
      existing.inventory_count += args[:quantity]
      existing.save
---
SELECT  "products".* FROM "products" WHERE "products"."title" = $1 LIMIT $2  [["title", "Shoes"], ["LIMIT", 1]]
INSERT INTO "products" ("title", "description", "inventory_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Shoes"], ["description", "good to wear"], ["inventory_count", 1], ["created_at", "2019-01-18 20:19:17.487783"], ["updated_at", "2019-01-18 20:19:17.487783"]]
UPDATE "products" SET "inventory_count" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["inventory_count", 2], ["updated_at", "2019-01-18 20:19:52.574779"], ["id", 4]]