app/graphql/mutations/check_out_cart.rb

  def call(_obj, args, _ctx)
    cart = ShoppingCart.find_by(user_id: args[:user_id])
    cart.cart_items.each do |cart_item|
      cur_product = Product.find_by(id: cart_item.product_id)
      if cur_product.inventory_count - cart_item.quantity < 0
        raise GraphQL::ExecutionError, "Quantity requested: #{cart_item.quantity}. Current inventory count for product: #{cur_product.inventory_count}."
      else
        cur_product.inventory_count -= cart_item.quantity
        cur_product.sold_count += cart_item.quantity
        cur_product.save
        cart_item.destroy
      end
    end
    cart.completed = !cart.completed
    cart.total_cost = 0
    cart.save
---
SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."shopping_cart_id" = $1  [["shopping_cart_id", 2]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "inventory_count" = $1, "sold_count" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["inventory_count", 25], ["sold_count", 36], ["updated_at", "2019-01-16 23:14:32.994750"], ["id", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 6]]
UPDATE "shopping_carts" SET "completed" = $1, "total_cost" = $2, "updated_at" = $3 WHERE "shopping_carts"."id" = $4  [["completed", true], ["total_cost", "0.0"], ["updated_at", "2019-01-16 23:14:33.000310"], ["id", 1]]