app/graphql/mutations/clear_cart.rb

SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "shopping_cart_id" = NULL WHERE "cart_items"."shopping_cart_id" = $1  [["shopping_cart_id", 1]]
UPDATE "shopping_carts" SET "total_cost" = $1, "updated_at" = $2 WHERE "shopping_carts"."id" = $3  [["total_cost", "0.0"], ["updated_at", "2019-01-18 19:30:42.260382"], ["id", 1]]
---
  def call(_obj, args, _ctx)
    cart = ShoppingCart.find_by(user_id: args[:user_id])
    cart.cart_items.clear
    cart.total_cost = 0
    cart.save
    ShoppingCart.find_by(user_id: args[:user_id])