app/graphql/mutations/create_shopping_cart.rb

  def call(_obj, args, _ctx)
    cart = ShoppingCart.find_by(user_id: [:user_id])
    if cart.nil?
      cart = ShoppingCart.create!(
        completed: false,
        total_cost: 0.00,
        user_id: args[:user_id]
      )
---
SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."user_id" IS NULL LIMIT $1  [["LIMIT", 1]]
INSERT INTO "shopping_carts" ("user_id", "completed", "total_cost", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["completed", false], ["total_cost", "0.0"], ["created_at", "2019-01-16 23:11:12.461159"], ["updated_at", "2019-01-16 23:11:12.461159"]]