app/graphql/resolvers/add_to_cart.rb

    def call(_obj, args, _ctx)
      product = Product.find_by(id: args[:product_id])
      cart = ShoppingCart.find_by(user_id: args[:user_id])
      cart.completed = false
      cart.save
      existing = cart.cart_items.find_by(product_id: product.id)
      if existing.nil?
        item = cart.cart_items.create!(product_id: product.id, quantity: args[:quantity])
      else
        existing.quantity += args[:quantity]
        existing.save
      end
      cart.total_cost += (product.price)*args[:quantity]+product.shipping
      cart.save
---
SELECT  "products".* FROM "products" WHERE "products"."product_id" = $1 LIMIT $2  [["product_id", "1"], ["LIMIT", 1]]
SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
UPDATE "shopping_carts" SET "total_cost" = $1, "updated_at" = $2 WHERE "shopping_carts"."id" = $3  [["total_cost", "13.47"], ["updated_at", "2019-01-13 20:49:38.151433"], ["id", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."shopping_cart_id" = $1 AND "cart_items"."product_id" = $2 LIMIT $3  [["shopping_cart_id", 1], ["product_id", 1], ["LIMIT", 1]]
INSERT INTO "cart_items" ("quantity", "created_at", "updated_at", "shopping_cart_id", "product_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 3], ["created_at", "2019-01-15 00:26:30.843717"], ["updated_at", "2019-01-15 00:26:30.843717"], ["shopping_cart_id", 1], ["product_id", 1]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 6], ["updated_at", "2019-01-14 20:15:46.457221"], ["id", 1]]
UPDATE "shopping_carts" SET "total_cost" = $1, "updated_at" = $2 WHERE "shopping_carts"."id" = $3  [["total_cost", "22.98"], ["updated_at", "2019-01-14 20:15:46.460358"], ["id", 1]]