app/graphql/resolvers/check_out_cart.rb

    def call(_obj, args, _ctx)

        cart = ShoppingCart.find_by(user_id: args[:user_id])
        cart.cart_items.each do |cart_item|
            cur_product = Product.find_by(id: cart_item.product_id)
            if cur_product.inventory_count - cart_item.quantity < 0
                    raise GraphQL::ExecutionError.new("Quantity requested: #{cart_item.quantity}. Current inventory count for product: #{cur_product.inventory_count}.")
            else
                    cur_product.inventory_count -= cart_item.quantity
                    cur_product.save
                    cart_item.destroy
            end
        end
        cart.completed = !cart.completed
        cart.total_cost = 0
        cart.save
---
SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."shopping_cart_id" = $1  [["shopping_cart_id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "products" SET "inventory_count" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["inventory_count", 17], ["updated_at", "2019-01-15 05:01:16.504627"], ["id", 2]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 3]]
UPDATE "shopping_carts" SET "completed" = $1, "updated_at" = $2 WHERE "shopping_carts"."id" = $3  [["completed", true], ["updated_at", "2019-01-13 22:59:05.483810"], ["id", 1]]