app/graphql/resolvers/purchase_by_id.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "inventory_count" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["inventory_count", 33], ["updated_at", "2019-01-13 03:50:13.670406"], ["id", 1]]
---
    def call(_obj, args, _ctx)

      product = Product.find_by(id: args[:product_id])
      if product.inventory_count ==0
            raise GraphQL::ExecutionError.new("Product with the ID: #{args[:product_id]} is out of inventory and unavailable.")
      else
        product.inventory_count -=1
        product.save
      end
      Product.find_by(id: args[:product_id])