app/graphql/types/query_type.rb

    description "Return product with the specified product id"

    resolve -> (_obj, args, _ctx) {
      Product.where("id= ?", args[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    argument :user_id, !types.ID, description: "Specified user_id"
    description "Return shopping cart based on specified user_id"
    resolve -> (_obj, args, _ctx) {
      ShoppingCart.where("user_id = ?", args[:user_id])
---
SELECT  "shopping_carts".* FROM "shopping_carts" WHERE "shopping_carts"."user_id" IS NULL LIMIT $1  [["LIMIT", 1]]